# Contents of ~/my_app/main_page.py
import streamlit as st

st.markdown("# 主页 🎈")
st.sidebar.markdown("# 主页 🎈")

st.markdown("Motivation")
st.markdown("""> 互联网是文化的载体，作为当今沟通的主要渠道，加速了文化的传播。文化差异得以缩小，文化交流藉此增进，然而其快速发展也使文化入侵获得了前所未有的机会。（2009）国际话语权背后的正是文化软实力，小约瑟夫·奈提教授称“在信息时代，软实力正变得比以往更为突出。”实际上，中国也一直非常重视国家软实力。（2013）而要提高国家文化软实力，就要努力展示中华文化独特魅力。习近平总书记就曾指出“应当更多聚焦在传播当代中国价值观念、体现中华文化精神、反映中国人审美追求，思想性、艺术性、观赏性有机统一的优秀作品。”(2014)

> 然而，在西方各种诸如漫威宇宙、哈利波特等文化IP长久畅销火热的衬托下，中国优秀的非物质传统文化得到的关注和传播显得非常有限。中国对于传统文化的宣传和推介处于原生状态，优秀的文化传统资源优势并未充分转化成为强大的现实生产力。由于多数情况下囿于文艺作品中，被束之高阁，缺少更亲切的呈现，因而难以“破圈”，得到更进一步的推广。实际上，中国非物质传统文化当今的存在形式与学者贺学君指出的“活态性”相悖。（2005）因为非物质传统文化不同于作为历史残留物的静止形态的物质传统文化，只要它继续存在，就应当始终是生动灵活的。以妖怪传统文化为例，它是有灵魂的，反映着古人在长期奋斗和创造中凝聚而成的民族精神。中国妖怪文化的内涵丰富，而妖怪定义的背后，就是当时中国人的某种世界观。妖怪文化作为中国非物质传统文化的精粹，也无疑需要得到持续的弘扬与推广。

> 目前与西方相对比，虽然我国借助互联网传播的文化内容产品就数量、规模而言，毫无疑问并不逊色，但是网络文化内容产品整体创新能力并不强，精品也严重不足，难以满足网民日益增长的网络文化需求。（2018）现如今，不乏有新生代的文艺创作者对中国传统妖怪进行二次创作，比如愿意“通过画笔，和温柔的山海异兽来一次跨越时空的精神碰撞”的插画师舍溪。（2021）3D和VR等科学技术给传统文化带来了更多的可能性。也有如张云等作者根植传统奠基，辑录历代文献，整理妖怪及其故事，还原妖怪本来面貌。

> 然而现在妖怪相关的艺术作品仍然存在着明显的不足，资源整体较为分散，没有形成体系，也尚未得到文本数据和图像数据二者有效的集成。如何提出一个可以将非结构化数据对齐的数据资源模型，对妖怪主题的资源进行分析建模，并且设计对应的索引系统，最终将其实现，是笔者认为亟需解决的问题。对中国妖怪建立一个数据库，具有十分重要的意义。不仅可以将已有的散落资源集成起来，同时可以通过网络化的方式，结合专业知识和技术手段，进一步弘扬中国传统文化。
""")

# Contents of ~/my_app/pages/page_2.py
import streamlit as st




# st.markdown("# 画廊 🎉")
st.sidebar.markdown("# 清单 :book:")
# st.markdown("# 检索 ❄️")
import streamlit as st
st.sidebar.markdown("# 检索 :mag: ")

# Contents of ~/my_app/pages/page_3.py
import streamlit as st

# st.markdown("# 画廊 🎉")
st.sidebar.markdown("# 画廊 :art:")

# Contents of ~/my_app/pages/page_3.py
import streamlit as st

# st.markdown("# 画廊 🎉")
st.sidebar.markdown("# 说明 :key:")

# from docarray import DocumentArray
#
# da = DocumentArray.from_files('./*.jpg')
# da.plot_image_sprites('sprite-img.png')
